Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/mental_health/mental_health_services.html.txt.tmx
Source language: en
Languages: ga

source: Your family doctor is usually the first person to approach in relation to mental health concerns
ga: Is é an dochtúir teaghlaigh an chéad duine a ndéantar teagmháil leis maidir le hábhair imní meabhairshláinte de ghnáth

source: Many people go to their family doctor (GP) with mental health problems such as depression or anxiety
ga: Téann go leor daoine chuig a ndochtúir teaghlaigh (LG) nuair a bhíonn fadhbanna meabhairshláinte orthu, ar nós dúlagair nó imní

source: In some cases, the GP may refer the person to a mental health professional such as a psychiatrist, clinical psychologist or addiction counsellor
ga: I gcásanna áirithe, féadfaidh an LG a chinneadh chun an duine a atreorú chuig gairmí meabhairshláinte, ar nós síciatraí, síceolaí cliniciúil nó comhairleoir andúile

source: In an emergency situation, when your GP is not available, you can contact a GP out-of-hours service or access the mental health services through your local mental health unit or hospital
ga: I gcás éigeandála, nuair nach bhfuil do GP ar fáil, is féidir leat teagmháil a dhéanamh le seirbhísí LG lasmuigh d’uaireanta oibre nó rochtain a fháil ar na seirbhísí meabhairshláinte trí d’aonad áitiúil meabhairshláinte nó trí d’ospidéal áitiúil

source: The mental health service has changed considerably over the last twenty years or so
ga: Tá athrú suntasach tagtha ar an tseirbhís mheabhairshláinte le tuairim is fiche bliain anuas

source: This has resulted in the development of better care and a more supportive service to individuals with mental illness
ga: Is éard a d’eascair as seo ná gur forbraíodh cúram níos fearr agus seirbhís níos tacúla do dhaoine aonair ar a bhfuil meabhairghalar

source: The Expert Group on Mental Health Policy produced the 2006 report A Vision for Change to provide a ten-year policy framework for Government
ga: Sa bhliain 2006, chuir an Sainghrúpa ar Bheartas Meabhairshláinte an tuarascáil Fís don Athrú le chéile chun creat beartais deich mbliana a sholáthar don Rialtas

source: Health services at your Local Health Office
ga: Seirbhísí Sláinte ag d’Oifig Sláinte Áitiúil

source: The Health Service Executive (HSE) provides a range of community-based mental health services
ga: Soláthraíonn Feidhmeanancht na Seirbhíse Sláinte (FSS) réimse de sheirbhísí pobalbhunaithe meabhairshláinte

source: The mental health team normally includes a consultant psychiatrist, registrar in psychiatry, and nurses
ga: Is é a bhíonn san fhoireann mheabhairshláinte de ghnáth ná síciatraí comhairleach, cláraitheoir sa tsíciatracht agus altraí

source: In many areas, the services of an addiction counsellor, psychologist, social worker and occupational therapist are available
ga: In go leor ceantar, tá seirbhísí comhairleoir andúile, síceolaí, oibrí shóisialta agus teiripeoir saothair ar fáil

source: When you are referred to a psychiatrist
ga: Nuair a atreoraítear thú chuig síciatraí

source: An out-patient appointment will usually occur within a few weeks of referral or, in an emergency, an immediate appointment may be arranged
ga: Is gnách go mbíonn coinne othair sheachtraigh ann laistigh de chúpla seachtain tar éis go n-atreoraítear an t-othar nó, i gcás éigeandála, féadtar coinne láithreach a shocrú

source: The psychiatrist will meet with you to discuss your mental health problems and to explain the treatment options available, which may include a course of medication
ga: Buailfidh an síciatraí leat chun d’fhadhbanna meabhairshláinte a phlé agus chun na roghanna cóireála atá ar fáil a mhíniú duit. D’fhéadfadh cúrsa cógais a bheith i gceist chomh maith

source: Treatment options include out-patient care: out-patient clinics (clients referred by GPs), day hospitals, day centres, home visits from the mental health team, referral to clinical psychological services, referral to addiction counselling services, access to social work or occupational therapy services and referral back to your GP for continuous care
ga: Áirítear iad seo a leanas le roghanna cóireála: cúram othair sheachtraigh, clinicí othair sheachtraigh, (cliaint a n-atreoraíonn LGanna iad), ospidéil lae, ionaid lae, cuairteanna baile ón bhfoireann mheabhairshláinte, atreorú chuig seirbhísí síceolaíochta cliniciúla, atreorú chuig seirbhísí comhairleoireachta andúile, rochtain ar sheirbhísí oibre sóisialta nó ar sheirbhísí teiripe shaothair agus atreorú ar ais chuig do LG le haghaidh cúram leanúnach

source: In-patient care, normally of short duration, is provided when a person is admitted to a psychiatric unit in hospital
ga: Cuirtear cúram othair chónaithigh ar fáil, ar feadh tréimhse ghairid de ghnáth, nuair a ligtear isteach duine in aonad síciatrach in ospidéal

source: Out-patient and community services
ga: Seirbhísí othair sheachtraigh agus seirbhísí pobail

source: The aim of out-patient and community services is to treat and support individuals in their own homes and communities where possible
ga: Is é aidhm na seirbhísí othair sheachtraigh agus na seirbhísí pobail ná cóireáil agus tacaíocht a chur ar fáil do dhaoine ina dtithe féin agus ina bpobail féin nuair is féidir

source: Family doctors (GPs) are central to the delivery of community care services
ga: Bíonn dochtúirí teaghlaigh (LGanna) ríthábhachtach maidir le seirbhísí cúram pobail a sholáthar

source: Out-patient clinic: This is a clinic that people attend for an assessment or for follow-up or continuing management of their mental illness
ga: Clinic othair sheachtraigh Clinic atá ann seo ar a bhfreastalaíonn daoine go dtabharfar faoi mheasúnú orthu nó coinne athleantach leo nó go ndéanfar bainistiú leanúnach ar a meabhairghalar

source: These facilities are often based in community health centres and are staffed by a consultant psychiatrist, community psychiatric nurses and other members of the mental health team, as required
ga: I bhformhór na gcásanna, bíonn na saoráidí sin lonnaithe in ionaid sláinte pobail agus bíonn an fhoireann mheabhairshláinte comhdhéanta, de réir mar is gá, de shíciatraí comhairleach, d’altraí síciatracha pobail agus de bhaill eile den fhoireann mheabhairshláinte

source: A consultant psychiatrist leads the psychiatric team
ga: Is é an síciatraí comhairleach an duine atá i mbun na foirne síciatraí

source: This psychiatrist will be responsible for the treatment of the person whether in the community or in hospital
ga: Beidh an síciatraí sin freagrach as cóireáil a chur ar an duine, cibé acu má chuirtear an chóireáil sin ar an othar sa phobal nó in ospidéal

source: Day hospital: This is a day facility where people with mental illness can attend from their home or care setting for an assessment, treatment or nursing care
ga: Ospidéal lae: Saoráid lae ar féidir le daoine a bhfuil meabhairghalar orthu freastal uirthi óna dteach nó óna suíomh cúraim le haghaidh measúnú, cóireála nó cúram altranais is ea seo

source: It is usually seen as an alternative for someone who would otherwise require hospital admission
ga: Is gnách go gcaitear leis mar rogha eile do dhuine a dteastódh cead isteach go hospidéal uaidh/uaithi ina mhalairt scéil

source: It is for people who are mentally unwell but who can also be cared for in their homes, for a period of time, without needing a hospital admission
ga: Tá sé dírithe ar dhaoine atá breoite i dtaobh cúrsaí meabhrach de ach ar féidir cúram a thabhairt dóibh ina dtithe, ar feadh tréimhse ama, gan cead isteach go hospidéal a bheith ag teastáil uathu

source: The consultant psychiatrist who sees the person in the out-patient clinic will usually treat them in the day hospital also
ga: Is gnách go ndéanfaidh an síciatraí comhairleach a dhéileálann leis an duine sa chlinic othair sheachtraigh cóireáil a chur ar an duine san ospidéal lae, chomh maith leis sin

source: Day centre: This is a community setting where people attend voluntarily from their home or care setting for continuing support
ga: Ionad lae: Suíomh pobail ar féidir le daoine freastal go deonach air óna dteach nó óna suíomh cúraim chun tacaíocht leanúnach a fháil is ea seo

source: It is staffed by psychiatric nurses and, occasionally, occupational therapists
ga: Is é a bhíonn i bhfoireann an aonaid ná altraí síciatracha agus, uaireanta, teiripeoirí saothair

source: The aim is to provide a friendly and supportive environment with activities suited to the needs of each individual
ga: Is é an aidhm atá leis ná timpeallacht chairdiúil agus thacúil a chur ar fáil, áit a gcuirtear gníomhaíochtaí in oiriúint do riachtanais gach duine

source: It is not unusual for some people to attend a day centre for a long period of time
ga: Ní rud as an ngnáth é daoine áirithe a bheith ag freastal ar ionad lae ar feadh tréimhse fhada ama

source: For others, a short period is all that is required
ga: I gcás daoine eile, ní theastaíonn uathu ach tréimhse ghairid chóireála

source: Sheltered workshop: This is a community facility where the emphasis is on people with mental illness working in areas suited to their skills or needs with support and guidance from trained staff
ga: Ceardlann dhídeanach: Saoráid phobail ina n-oibríonn daoine a bhfuil meabhairghalar orthu i réimsí atá oiriúnach dá gcuid scileanna agus riachtanas, agus iad ag fáil tacaíochta agus treorach ó bhaill foirne oilte, is ea seo

source: Out of hours services
ga: Seirbhísí lasmuigh d’uaireanta oibre

source: If you need help in the evening or at the weekend when your GP is not available you can contact your local GP out-of-hours service
ga: Má theastaíonn cabhair uait i gcaitheamh an tráthnóna nó ag an deireadh seachtaine nuair nach bhfuil do LG ar fáil, féadfaidh tú teagmháil a dhéanamh le seirbhís lasmuigh d’uaireanta oibre do LG áitiúil

source: In an emergency or crisis you can contact the emergency services or go to your hospital emergency department
ga: I gcás éigeandála nó géarchéime, féadfaidh tú teagmháil a dhéanamh leis na seirbhísí éigeandála nó cuairt a thabhairt ar rannóg éigeandála d’ospidéil

source: Most people who have mental health problems are treated without going to hospital or go to hospital for treatment by choice
ga: I gcás fhormhór na ndaoine a bhfuil fadhbanna meabhairshláinte orthu, cuirtear cóir leighis orthu gan orthu dul chuig an ospidéal nó téann siad chuig an ospidéal le haghaidh cóireála dá rogha féin

source: If you are admitted by choice you are known as a voluntary patient
ga: Sa chás go ligtear isteach thú de do rogha féin, tugtar othar deonach ort

source: Occasionally someone may have to be admitted for mental health treatment and care against their will
ga: Uaireanta, is gá duine a ligean isteach le haghaidh cóireáil mheabhairshláinte agus cúram meabhairshláinte in aghaidh a dtola

source: This is called 'involuntary admission'
ga: Tugtar ‘ligean isteach neamhdheonach’ air seo

source: You can only be admitted against your will if it is considered you meet the conditions for involuntary admission
ga: Ní ligfear isteach thú in aghaidh do thola ach amháin i gcásanna ina meastar go gcomhlíonann tú na coinníollacha le haghaidh ligean isteach neamhdheonach

source: These conditions are the rules set out in the law to ensure you are only admitted involuntarily if it is absolutely necessary
ga: Is ionann na coinníollacha sin agus na rialacha a leagtar amach sa dlí chun a chinntiú nach ligfear isteach go neamhdheonach thú ach amháin i gcásanna ina bhfuil géarghá leis

source: For more information see our document on admission to a psychiatric hospital
ga: Chun teacht ar bhreis faisnéise, féach ár gcáipéis ar chead isteach chuig ospidéal síciatrach

source: In-patient services refer to medical and nursing care that is provided in a mental health facility, which is usually a hospital
ga: Is é atá i gceist le seirbhísí othair chónaithigh ná cúram leighis agus altranais a chuirtear ar fáil i saoráid mheabhairshláinte, arb ospidéal a bhíonn i gceist i mórán cásanna

source: In line with HSE policy, the large psychiatric hospitals that are often known as institutions are now being replaced by smaller psychiatric units attached to general hospitals
ga: Ar aon dul le beartas Fheidhmeannacht na Seirbhíse Sláinte (FSS), tá na hospidéil mhóra shíciatracha, dá dtagraítear mar institiúidí de ghnáth, á gcur in ionad faoi láthair ag aonaid bheaga shíciatracha atá nasctha le hospidéil ghinearálta

source: Acute admission ward: This is an area of the hospital where patients are cared for on admission for treatment and assessment of their presenting problem
ga: Barda iontrála géarmhíochaine: Limistéar den ospidéal ina dtugtar cúram d’othair ar a ligean isteach chun an fhadhb atá acu a chóireáil agus a mheasúnú is ea seo

source: After treatment, the vast majority of patients will be discharged home and follow-up care is provided by the out-patients clinic or day hospital
ga: Tar éis iad a chóireáil, scaoiltear formhór mór na n-othar saor agus cuirtear cúram leantach ar fáil i gclinic othar seachtrach nó in ospidéal lae

source: However, some patients may be transferred from an admission unit to a continuing care ward, a rehabilitation ward or a care of the elderly ward, according to their needs
ga: De réir na riachtanas atá acu, áfach, déantar othair áirithe a aistriú ó aonad iontrála chuig barda cúraim leanúnaigh, chuig barda athshlánúcháin nó chuig barda cúraim do dhaoine scothaosta

source: Continuing care ward: This is an in-patient facility that provides care for patients who often have long-term enduring mental illness
ga: Barda cúraim leanúnaigh: Saoráid d’othair chónaitheacha í seo ina gcuirtear cúram ar fáil d’othair ar gnách go mbíonn meabhairghalar buan fadtéarmach orthu

source: A small percentage will be discharged to another facility such as a residential unit
ga: Scaoilfear le céatadán beag díobh chuig saoráid eile ar nós aonad cónaithe ina dhiaidh sin

source: This unit may be used as a respite area for those patients in the community who need it
ga: Is féidir an t-aonad sin a úsáid mar limistéar faoisimh do na hothair sin sa phobal a bhfuil gá acu leis

source: Rehabilitation ward: This is an in-patient facility where the emphasis of care is on re-skilling patients with everyday living skills
ga: Barda athshlánúcháin: Saoráid othair chónaithigh ina gcuirtear béim an chúraim ar thuilleadh scileanna a chur ar othair a bhfuil scileanna ghnáthmhaireachtála acu is ea seo

source: This is done in order to improve their quality of life and help them regain a level of independence that will enable them to live in their homes or a residential facility
ga: Déantar é sin ar mhaithe le feabhas a chur ar cháilíocht a mbeatha agus cabhrú leo méid áirithe neamhspleáchais a athghnóthú, rud a chuirfidh ar a gcumas cónaí ina dteach nó i saoráid chónaithe

source: Special care unit or secure ward: Sometimes it may be necessary to care for and treat a patient in a safe and restricted environment due to the nature of their mental illness
ga: Aonad cúraim speisialta nó barda slán: Uaireanta, bíonn gá le cúram agus le cóireáil a chur ar fáil d’othar i dtimpeallacht shlán shrianta de bharr chineál a meabhairghalair

source: This is usually a small unit within a hospital setting staffed by highly trained psychiatric nurses
ga: Déantar é sin in aonad beag laistigh de shuíomh ospidéil ina mbíonn foireann altraí ardoilte síciatracha de ghnáth

source: The unit is locked and the environment is secure
ga: Bíonn an t-aonad faoi ghlas agus bíonn an timpeallacht slán

source: Patients who, because of their mental illness, have disturbed behaviour that does not respond to treatment may require an admission to a secure unit
ga: D’fhéadfadh go mbeadh gá le cead isteach a thabhairt d’othair go haonad slán sa chás go bhfuil iompar suaite ar bun acu mar gheall ar an meabhairghalar atá orthu, iompar nach féidir a chóireáil

source: Care of the elderly unit: This is a specialised unit for the 24-hour care and treatment of patients, usually those over 60 years of age, who have a mental illness or associated problems
ga: Aonad cúraim do dhaoine scothaosta: Sainaonad ina gcuirtear cúram agus cóireáil 24 uair ar othair, iad siúd os cionn 60 bliain d’aois de ghnáth, a bhfuil meabhairghalar orthu nó a bhfuil fadhbanna gaolmhara acu is ea seo

source: The environment is designed to meet the needs of the elderly
ga: Tá an timpeallacht deartha chun freastal ar riachtanais daoine scothaosta

source: Occupational therapy: This is an in-patient facility for the assessment of particular skills by trained staff
ga: Teiripe shaothair: Saoráid othair chónaithigh ina ndéanann baill foirne oilte measúnú ar scileanna ar leith is ea seo

source: There is an emphasis on improving social skills and concentrating on other essential skills
ga: Leagtar béim ann ar scileanna sóisialta a fheabhsú agus ar aird a thabhairt ar scileanna riachtanacha eile

source: High-support group home: This is a residential home for people who do not need to be in hospital and who can live in the community but who require 24-hour nursing care and support for a variety of reasons
ga: Teach grúpa ardtacaíochta: Teach cónaithe do dhaoine nach gá dóibh bheith in ospidéal is ea seo. Is féidir leis na daoine sin cónaí sa phobal ach teastaíonn cúram agus tacaíocht altranais 24 uair uathu ar chúiseanna éagsúla

source: Some people may spend a period of time in a high support residence and then move on into a medium or low support residence
ga: Is féidir le daoine áirithe tréimhse ama a chaitheamh in áit chónaithe ardtacaíochta agus bogadh isteach in áit chónaithe meántacaíochta nó ísealtacaíochta ina dhiaidh sin

source: Medium-support group home: This is a residential home for people who are fairly independent in most areas of their everyday living skills but who require some assistance or support in certain areas, for example, managing finances or cooking skills
ga: Teach grúpa meántacaíochta: Teach cónaithe do dhaoine atá measartha neamhspleách i bhformhór na ngnéithe dá scileanna gnáthmhaireachtála is ea seo

source: For this reason, the home is staffed, usually by day only, by either a nurse or a trained care staff
ga: Teastaíonn roinnt cúnaimh nó tacaíochta uathu i ngnéithe áirithe, mar shampla, airgeadas a bhainistiú nó scileanna cócaireachta

source: Low-support group home: These residential units are for individuals who are independent in most if not all areas of their everyday living skills
ga: Teach grúpa ísealtacaíochta: Tá na haonaid chónaithe seo deartha do dhaoine atá neamhspleách i bhformhór na ngnéithe dá scileanna gnáthmhaireachtála, nó i ngach ceann díobh

source: The overall upkeep and management of the group home is co-ordinated by the hospital management
ga: Is é lucht bainistíochta an ospidéil a dhéanann comhordú ar chothabháil agus ar bhainistiú iomlán an tí ghrúpa

source: The residents may have a community psychiatric nurse or supervisor who will check on them as required
ga: Is féidir leis na cónaitheoirí sin teacht ar altra síciatrach pobail nó ar mhaoirseoir, duine a thabharfaidh aird dóibh nuair is gá

source: Further information on mental health services and treatment options is available from your family doctor (GP), your Local Health Office and the Mental Health Commission
ga: Tá fáil ar bhreis faisnéise ar sheirbhísí meabhairshláinte agus ar roghanna cóireála ó do dhochtúir teaghlaigh (LG), d’Oifig Sláinte Áitiúil agus an Coimisiún Meabhair-Shláinte

source: You can find local mental health services on yourmentalhealth.ie
ga: Féadfaidh tú teacht ar sheirbhísí meabhairshláinte áitiúla ar yourmentalhealth.ie
